app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @count_active = User.active_count.count
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT COUNT(*) FROM `users` WHERE `users`.`active_user` = 1

  def avatar
    @user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

  def update
    @user = User.find(params[:id])
    @user.assign_attributes(user_params)
    if @user.changed?
      if @user.update_attributes(user_params)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1
UPDATE `users` SET `password_digest` = '$2a$10$IAFGNf6BM3ab0XpKEpwpveCcg4GQmKhyZb0Rzhm/iQGTnvvcz223O', `avatar_file_name` = 'dog.jpeg', `avatar_content_type` = 'image/jpeg', `avatar_file_size` = 5979, `avatar_updated_at` = '2014-07-21 14:57:20', `updated_at` = '2014-07-21 14:57:20' WHERE `users`.`id` = 1

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO `users` (`created_at`, `email`, `name`, `password_digest`, `remember_token`, `updated_at`) VALUES ('2014-06-04 16:09:30', 'andre@andaff.com', 'Andre Blais', '$2a$10$txq2Gkuc.1/3Jz4ng4MtouXT65etTDIDj2jjY9MddqVu12C54OO1O', '18890ec16a3d6c5905a7be1ca261b39c96cf019a', '2014-06-04 16:09:30')